app/views/admin/_user.html.erb

SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ? AND (((roles.name = 'admin') AND (roles.resource_type IS NULL) AND (roles.resource_id IS NULL)))  [["user_id", 2]]
---
        <td><%= user.email %></td>
        <td><%= user.roles.first.name if user.roles.first.presence %></td>