app/controllers/admin_controller.rb

  def index
    @users = User.all
    @fooddrinks = Fooddrink.all
---
SELECT "users".* FROM "users"
SELECT "fooddrinks".* FROM "fooddrinks"