app/controllers/admin_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT  "rates".* FROM "rates" WHERE "rates"."rater_id" = ? LIMIT 1  [["rater_id", 6]]
SELECT "fooddrinks".* FROM "fooddrinks"
DELETE FROM "rates" WHERE "rates"."rater_id" = ?  [["rater_id", 10]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
UPDATE "fooddrinks" SET "avg" = ?, "qty" = ?, "updated_at" = ? WHERE "fooddrinks"."id" = ?  [["avg", 4.0], ["qty", 2], ["updated_at", "2016-11-03 07:37:51.725807"], ["id", 7]]
UPDATE "rating_caches" SET "avg" = ?, "qty" = ?, "updated_at" = ? WHERE "rating_caches"."id" = ?  [["avg", 4.0], ["qty", 2], ["updated_at", "2016-11-03 08:51:54.867167"], ["id", 9]]
---
  def destroy_user
    user = User.find(params[:id])
    rates = Rate.where(:rater_id => user.id)
    fooddrinks = Fooddrink.all
    user.destroy
    rates.delete_all

    fooddrinks.each do |fooddrink|
      Fooddrink.update_avg_qty(fooddrink)
      rating_cache = RatingCache.find_by(:cacheable_id => fooddrink.id)
      rating_cache.update_attributes(:avg => fooddrink.avg, :qty => fooddrink.qty) if rating_cache.presence