app/controllers/fd_types_controller.rb

  def show
    @fooddrinks = @fd_type.fooddrinks.paginate(page: params[:page], per_page: 9).order(created_at: :asc)
---
SELECT  "fooddrinks".* FROM "fooddrinks" WHERE "fooddrinks"."fd_type_id" = ?  ORDER BY "fooddrinks"."created_at" ASC LIMIT 9 OFFSET 0  [["fd_type_id", 5]]