app/controllers/fooddrinks_controller.rb

SELECT "fooddrinks".* FROM "fooddrinks"
UPDATE "fooddrinks" SET "avg" = ?, "qty" = ?, "updated_at" = ? WHERE "fooddrinks"."id" = ?  [["avg", 4.0], ["qty", 1], ["updated_at", "2016-11-03 07:09:14.577808"], ["id", 3]]
---
  def show
    @fooddrinks = Fooddrink.all
    Fooddrink.update_avg_qty(@fooddrink)

INSERT INTO "fooddrinks" ("name", "address", "review", "fd_type_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Food One"], ["address", "Ha Noi"], ["review", ""], ["fd_type_id", 4], ["user_id", 3], ["created_at", "2016-11-01 07:43:36.100244"], ["updated_at", "2016-11-01 07:43:36.100244"]]
---
  def create
    @fooddrink = Fooddrink.new(fooddrink_params)
    @fooddrink.user_id = current_user.id

    respond_to do |format|
      if @fooddrink.save

UPDATE "fooddrinks" SET "file" = ?, "fd_type_id" = ?, "updated_at" = ? WHERE "fooddrinks"."id" = ?  [["file", "cmmd.jpg"], ["fd_type_id", 1], ["updated_at", "2016-11-02 09:08:03.756380"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @fooddrink.update(fooddrink_params)

DELETE FROM "fooddrinks" WHERE "fooddrinks"."id" = ?  [["id", 8]]
---
  def destroy
    @fooddrink.destroy

SELECT  "fooddrinks".* FROM "fooddrinks" WHERE "fooddrinks"."id" = ? LIMIT 1  [["id", 8]]
---
    def set_fooddrink
      @fooddrink = Fooddrink.find(params[:id])

SELECT "fd_types".* FROM "fd_types"
---
    def load_category
      @categories = FdType.all