app/controllers/static_pages_controller.rb

SELECT "fooddrinks".* FROM "fooddrinks"
SELECT "fd_types".* FROM "fd_types"
SELECT "fooddrinks".* FROM "fooddrinks" WHERE "fooddrinks"."foodtype" = ?  ORDER BY "fooddrinks"."avg" DESC  [["foodtype", "t"]]
---
  def home
    @fooddrinks = Fooddrink.all
    @users = User.all

    @fd_types = FdType.all


    @recommendfood = Fooddrink.where(foodtype: true).order(avg: :desc)