app/controllers/users_controller.rb

    def show
        @user = User.find(params[:id])
        @fooddrinks = @user.fooddrinks.paginate(page: params[:page], per_page: 9).order(created_at: :asc)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "fooddrinks" WHERE "fooddrinks"."user_id" = ?  [["user_id", 2]]